#Лабораторная работа 3
## Задание 1 - Открытие и чтение файла
> 1.	Создайте текстовый файл **example.txt** и заполните его несколькими строками текста.
> 2.	Напишите функцию на Python, которая открывает файл **example.txt** в режиме чтения и выводит его содержимое на экран.
> 3.	Используйте разные методы чтения файла: чтение всего файла сразу, построчное чтение, реализуйте выбор типа чтения в принимаемых аргументах функции.
```python
def read_file(name, type):
    try:
        if type == 'full':
            with open(f'{name}', 'r') as file:
                print(file.read())


        elif type == 'line':
            with open(f'{name}', 'r') as file:
                for line in file:
                    print(line)
    except FileNotFoundError:
        print('Нет файла с таким назанием')

name_of_file = input('Введите название файла: ')
Type = input('Укажите, как Вы хотите прочитать файл: полностью(fool) или построчно(line): ')
print()

read_file(name_of_file, Type)
```
С помощью условного оператора `if` орпеделяем, как пользователь хочет прочитать файл - полностью или построчно.
Открываем файл при помощи `with open()` с указанием имени файла и режима открытия. 
В данном случае `'r'` - режиме чтения.
Благодаря этой конструкции файл автоматически закроется при завершении программы.
Если указанного файла не существует - ошибка `FileNotFoundError`. Выводится сообщение об ошибке на экран.

## Задание 2 - Запись в файл
> 1.	Напишите программу, которая запрашивает у пользователя текст и записывает его в новый файл **user_input.txt**.
> 2.	Реализуйте функционал добавления текста в существующий файл, не удаляя его предыдущее содержимое.
```python
def write_file(ans):
    if ans == 'rewrite':
        text = input('Введите текст: ')
        with open('user_input_txt', 'w') as file:
            file.write(text + '\n')

    elif ans == 'add':
        text_two = input('Введите текст, который хотите добавить: ')
        with open('user_input_txt', 'a') as file:
            file.write(text_two + '\n')

que = input('Перезаписать файл(rewrite) или добавить текст(add): ')
write_file(que)
```
Создаем функцию `write_file`, которая с помощью условного оператора `if` определяет, хочет пользователь перезаписать файл - `rewrite` или добавить текст в существующий файл, не удаляя его предыдущее содержимое - `add`.
Запись с очищением - `w`.
Дозапись - `a`.
